---
kind: enumMember
id: F:Autodesk.Revit.UI.RibbonItemType.ComboBox
enum: Autodesk.Revit.UI.RibbonItemType
source: html/12cf9be6-78be-2162-3a42-84dcb3abbd57.htm
---
# Autodesk.Revit.UI.RibbonItemType.ComboBox

A selection control with a drop-down list that can be shown or hidden by clicking the arrow on the control.